[{"eventid":6,"title":"Tariffs of 25% on steel and 10% on aluminum imports were announced by the U.S."},{"eventid":7,"title":"The U.S. announces plans to impose tariffs on $50 billion worth of Chinese imports."},{"eventid":11,"title":"The Trump administration announces tariffs on $50 billion worth of Chinese goods, including key industrial technology, in response to China's alleged intellectual property theft."},{"eventid":12,"title":"The U.S. imposes the first tranche of tariffs on $34 billion worth of Chinese imports, prompting immediate retaliation from China."},{"eventid":19,"title":"The U.S. raises tariffs on $200 billion worth of Chinese imports from 10% to 25%, further escalating the trade war. (intention announced in Trump tweets on May 5)"},{"eventid":23,"title":"Announcement of investigation into China's handling of COVID-19. Blaming China for the pandemic's spread further strained relations."},{"eventid":28,"title":"the Holding Foreign Companies Accountable Act was passed, which required foreign companies listed on U.S. exchanges to permit inspections of their audit papers by the Public Company Accounting Oversight Board (PCAOB). Chinese companies had previously resisted this due to China's state secrecy laws."},{"eventid":33,"title":"The HFCAA list: first wave"},{"eventid":33,"title":"The HFCAA: Weibo was added to the list."},{"eventid":33,"title":"The HFCAA: Baidu, iQIYI etc 5 additional firms added."},{"eventid":33,"title":"The HFCAA: 12 additional incl. Sohu, Melco were added."},{"eventid":33,"title":"The HFCAA: 17 additional incl. Li Auto, Ke Holdings, Luckin were added."},{"eventid":33,"title":"The HFCAA: 88 added."},{"eventid":35,"title":"The Biden administration imposes sweeping export controls on advanced semiconductor technology to China, citing national security concerns."},{"eventid":41,"title":"The US Department of Commerce sanctions Chinese telecommunications equipment manufacturer ZTE by adding it to the Entity List, which means American companies cannot sells goods or services to ZTE without a license."},{"eventid":44,"title":"The Chinese government self-initiates antidumping and countervailing duty investigations of roughly $1 billion of US exports of sorghum. While this is not an explicit retaliation linked to Trump’s tariffs on solar panels and washing machines, the coincidence of timing suggests a repeat of China’s retaliatory response to President Obama’s imposition of a safeguard tariff on tires in September 2009."},{"eventid":57,"title":"China’s Commerce Ministry announces a formal case alleging that US tariffs have damaged China’s trade interests."},{"eventid":58,"title":"President Trump finalizes the list of products on $200 billion of imports from China that will be subject to a 10 percent tariff that goes into effect on September 24."},{"eventid":61,"title":"President Trump announces via Twitter that he will delay the tariff increase on $200 billion of imports from China that had been scheduled to go into effect on March 1, 2019."},{"eventid":68,"title":"China releases its plan to retaliate on $75 billion of US exports, effective September 1 and December 15, 2019, in response to Trump’s forthcoming tariffs on $300 billion of Chinese goods. The most significant change is that China will increase its average tariff on US autos from 12.6 to 42.6 percent."},{"eventid":70,"title":"Trump announces the October 15 tariff increase on $250 billion of US imports from China (25 percent raised to 30 percent) will not go ahead as planned. He also states negotiations had resulted in a forthcoming “substantial phase one deal” with China, “subject to getting it written.”"},{"eventid":72,"title":"Trump calls off the scheduled December 15 tariff increase and indicates his administration and China have reached agreement on the legal text of an 86-page deal that will be signed in January 2020."},{"eventid":81,"title":"Trump Ends Hong Kong’s Special Status"},{"eventid":93,"title":"US House Speaker Nancy Pelosi visits Taipei."},{"eventid":97,"title":"China's retaliatory tariffs (mentioned in the event below)"}]